public class Main {

    public static void main(String[] args) {
        /**
         * Написать DataMapper. Он мапит бины из Java в файл.      Это описывается в М. Фаулер "Архитектура КПП".
         * Объектно-реляционное отображение.
         * Bean состоит из полей класса, гетеров и сетеров. Предназначен для сохранения в файл или БД.
         * Bean соответсвует таблице, а экземпляр - строке таблицы.
         *
         * В датамаппере есть saveObject, loadObject, updateObject, deleteObject
         *
         * Создать аннотацию Entity(fileName = ""), в которой помечать те классы, объекты которых будем сохранять.
         * Нужно знать
         * ID - long
         *
         */
    }
}
